package meal.recipe.material;

public class DishRecipeTxt {
	public static String[] soybeanPasteStew = { "1. 물 1.5에 다시마, 멸치는 망에 넣고 된장과 마늘을 다져서 냄비에 한데넣고 한 소끔 끓여줍니다.",
			"2. 그 사이 양파, 애호박, 청양고추, 두부, 대파는 적당한 크기로 썰어줍니다.", "3. 한 소끔 끓은 된장물에 양파, 애호박, 청양고추, 두부, 대파를 넣어 줍니다.",
			"4. 애호박이 익을 때까지 끓여주어 간을 보고 아직 싱거우시다면 조금 더 끓여주시면 완성입니다." };
	public static String[] dolsotBibimbab = { "1. 애호박은 돌려깍아 얇게 채썰고 소금에 절인 후 물기를 꼭 짜내어 팬에 참기름을 약간 둘러서 볶아줍니다.",
			"2. 고사리, 시금치와 콩나물은 끓는 물에 살짝만 데쳐 약간의 소금, 들기름, 다진 마늘로 간단한 양념을 해줍니다.", "3. 마늘은 다져놓고 도라지는 길게 채썰어 놓습니다.",
			"4. 당근도 얇게 채썰어 소금간 약간해서 볶습니다.", "5. 계란지단을 부쳐 얇게 채썰어 둡니다.",
			"6. 뚝배기 안쪽에 참기름 1큰술을 바르고 밥을 담은 후 센불에서 올려 뚝배기가 달구어지면 약불에서 10분 정도 두어 누룽지를 만들어 주세요.",
			"7. 누룽지가 어느 정도 생기면 비빔밥 재료들을 둘러 담고 가운데 고추장을 올려 내시면 완성입니다." };
	public static String[] bulgogi = { "1. 돼지 앞다리살은 키친타월에 올려 핏물제거해 준비합니다.", "2. 대파 줄기 부분은 곱게 다져줍니다.",
			"3. 다진 마늘과 다진 생강 약간을 준비해줍니다.", "4. 후추와 청주, 간장, 설탕, 참기름으로 양념을 만들고 핏물 뺀 돼지고기는 볼에 담아 양념을 넣어줍니다.",
			"5. 조물조물 버무려 맛있는 양념이 배이도록 10분간 재웁니다.", "6. 팬은 센불에서 뜨겁게 달군 다음 양념한 고기를 넣어 줍니다.",
			"7. 센불로 유지하고 한 번 볶고 잠시 두었다 다시 볶습니다.", "8. 깻잎은 돌돌말아 채썰어 올려주면 돼지불고기 완성입니다." };
	public static String[] japchae = { "1. 소고기는 다진 마늘 0.5, 후춧가루, 적당량을 넣어 조물 조물 고기 밑간을 해줍니다.",
			"2. 잡채에 넣을 당근, 양파, 표고버섯을 채 썰어줍니다.", "3. 시금치는 물에 씻어 물기를 빼고 준비합니다.", "4. 달군 팬에 식용유를 두르고 양파와 소금을 넣어 볶아줍니다.",
			"5. 같은 방법으로 표고버섯을 볶아줍니다.", "6. 당근, 파프리카도 소금 간을 살짝 하고 볶아줍니다.", "7. 시금치 역시 소금 간을 하고 살짝 볶아줍니다.",
			"8. 맨 마지막으로 밑간해 놓은 소고기를 달달 볶아 줍니다.", "9. 냄비에 물을 담고 센 불에서 물이 팔팔 끓어오르면 당면을 넣고 10~11분 정도 센 불에서 푹 삶아줍니다.",
			"10. 삶아낸 당면은 바로 찬물에 헹궈 체에 밭쳐 물기를 빼줍니다.", "11. 팬에 식용유 2, 간장 5, 올리고 당 2를 한데 넣고 삶아 놓은 당면을 넣어줍니다.",
			"12. 그리고 물기가 사라질 때까지 볶아 주심 됩니다.",
			"13. 볶아 놓은 당면은 한 김 식히고 볶아 놓았던 야채로 모두 한데 넣고 참기름 2, 깨 1 설탕 0.5를 넣어 고루 버무려 마무리해주시면 완성입니다." };
	public static String[] seafoodPancake = { "1. 감자와 양파, 당근, 애호박은 채썰어 놓고 대파는 듬성 듬성, 고추는 잘게 썰어놓습니다.",
			"2. 새우와 오징어, 홍합은 손질해놓고 오징어는 잘게 썰어놓습니다.",
			"3. 부침가루 2컵, 튀김가루 1컵, 찬물 1.5컵을 먼저 살살 풀어 놓고, 소금과 설탕, 그리고 모든 재료를 섞어줍니다.",
			"4. 기름을 넉넉히 두르고 잘 달궈진 팬에, 반죽을 둥글납짝 하게 펴면 완성입니다." };
	public static String[] galbijjim = { "1. 물을 중간중간 갈아주며 1시간에서 1시간반정도 넉넉히 핏물을 빼줍니다.",
			"2. 그사이 고기와 함께 넣어줄 야채들은 먹기좋게 썰어 준비합니다.",
			"3. 진간장 1 컵, 설탕 1/2 컵, 맛술 1/2 컵, 다진 마늘 2 큰술, 생강 1/3 스푼, 참기름 2 큰술, 물 2 컵에 대파 1 대도 송송 썰어 넣고 가라앉은 설탕이 잘 섞일수 있도록 휘휘 저어줍니다.",
			"4. 핏물 잘 빠진 고기는 양념장에 넣어주시고 불을 켜 바로 조리를 시작합니다.",
			"5. 갈비가 팔팔 끓어오르면 위쪽으로 둥둥 뜨는 거품이나 불순물은 중간중간 국자를 이용해 걷어주시고 준비해둔 야채를 넣어 국물이 졸아들때까지 푹 끓여줍니다." };
	public static String[] riceCakeSoup = {
			"1. 소고기는 흐르는 물에 가볍게 헹군 뒤 키친타올로 꾹꾹 눌러 물기를 제거해주시고 떡국 떡은 흐르는 물에 가볍게 헹궈 체에 밭쳐 물기를 빼줍니다.",
			"2. 계란 2개는 그릇에 깨서 젓가락으로 풀어주시고 대파는 어슷 썰어줍니다.",
			"3. 예열한 팬에 참기름 1 큰 술과 식용유 1 큰 술, 소고기를 넣고, 핏기가 없어질 때까지 달달 볶아줍니다.",
			"4. 물 200ml와 국간장 1 큰 술을 넣고 국물이 끓어오르면, 물 600ml를 추가로 넣고 바글바글 끓여줍니다.",
			"5. 떡국 떡과 다진 마늘 1 큰 술을 넣어주시고 나머지 간은 소금으로 해줍니다.", "6. 계란과 대파, 후추를 톡톡 넣고 한 소끔 끓여주고 김가루를 위에 올려주면 완성입니다." };
	public static String[] oyakodon = { "1. 껍질과 기름을 제거한후 먹기좋은 크기로 잘라 찬물로 깨끗하게 씻어서 준비해줍니다.", "2. 닭고기 밑간을해줍니다.",
			"3. 양파는 채썰어 준비합니다.", "4. 파도 송송 썰어 줍니다.", "5. 파와 계란을 함께 넣고 섞어줍니다.", "6. 기름 살짝 두른 팬에 밑 간해둔 닭고기를 볶아줍니다.",
			"7. 닭고기 겉이 노릇해지고 반쯤익었을때 양파와 후추도 함께 넣고 볶아줍니다.", "8. 쯔유와 소금 설탕을 넣어 양념을 만들고 한 번 끓여줍니다.",
			"9. 끓고나면 약한불로 닭고기를 익혀줍니다.", "10. 제일 약한불로 줄인후 위로 대충 풀어준 계란을 부어줍니다.",
			"11. 그릇에밥을 먼저 담고 그 위로 완성된 닭고기를 올려주시면 완성됩니다." };
	public static String[] nabe = { "1. 청경채는 깨끗하게 씻어서 머리 부분을 잘라 주시고 버섯은 젖은 수건으로 닦아줍니다.",
			"2. 표고버섯의 윗부분을 칼로 조각을 내어 주고 백만송이버섯과 팽이버섯은 밑동을 잘라줍니다.",
			"3. 고기는 키친타월로 핏물을 제거해주시고 배추와 깻잎은 깨끗하게 씻은 후 물기를 제거해주시고 냄비에 육수재료를 모두 넣고 10분간 끓이다 다시마를 건져낸 후 10분가량 더 끓여서 육수를 만들며 간장을 조금 넣어 간을 맞춰 줍니다.",
			"4. 배추, 깻잎, 고기, 배추 순으로 차곡차곡 쌓으신 후 전골 냄비 높이에 맞춰서 잘라주고 전골 냄비에 청경채를 깔아주신 후 잘라 놓은 배추와 고기를 겹겹이 담아줍니다.",
			"5. 마지막으로 버섯를 넣고 육수를 냄비의 2/3정도가 올라오도록 넣은 후 배추와 고기가 익을 때까지 끓여주시면 완성입니다." };
	public static String[] tonkotsuRamen = { "1. 물과 맛술에 월계수잎, 통후추를 넣고 돼지고기를 가볍게 데쳐주며 겉 면을 다 구워놓습니다.",
			"2. 간장 3 , 맛술 2 , 물 3의 비율에 설탕 0.5, 올리고당 조금을 넣고 통마늘과 대파를 썰어 조립니다.", "3. 고기를 건져내어 썰어줍니다.",
			"4. 돼지등뼈를 푹 고아둔 육수와 라면을 살짝 데쳐 끓여둔 육수에 붓고 취향에 따라 소금, 된장, 간장으로 간하고 차슈 올리고 숙주 올리고 대파 올려주면 완성입니다." };
	public static String[] okonomiyaki = { "1. 양배추를 얇게 채 썰어 준비합니다.", "2. 삽겹살을 얇게 썰어 준비해 놓습니다.",
			"3. 밀가루에 물은 180ml 정도 넣고 달걀도 넣습니다.", "4. 야채와 해산물을 넣어 반죽합니다.", "5. 달구어진 팬에 기름을 넉넉히 두르고 앞뒤 노릇하게 구워줍니다.",
			"6. 소스를 바르고 가쓰오부시를 올려줍니다.", "7. 쪽파가 있으면 잘게 설어서 솔솔 뿌려줍니다.", "8. 마지막에 마요네즈로 먹음직스럽게 뿌려주면 완성됩니다." };
	public static String[] soba = { "1. 쯔유와 냉수를 2:3의 비율로 섞어 잠시 냉동실에 넣어둡니다.",
			"2. 무 한토막을 강판에 가는데 이때 무의 뿌리 쪽 초록 부분을 가는 것이 맛이 더 좋기 때문에 무를 생으로 즐기실 때는 초록부분을 사용합니다.",
			"3. 간 무를 고운 체에 넣고 생수를 뿌려 헹구면서 매운맛을 씻어냅니다.", "4. 고추냉이 가루를 찬물에 갭니다.",
			"5. 동치미 무는 얇게 썰고 오이는 곱게 채썰고 쪽파는 송송 썰어 준비합니다.",
			"6. 재료를 준비하는 동안 면 삶을 물을 올려 끓으면 면을 삶아내 찬 물에 여러 번 헹궈 전분기를 제거합니다.",
			"7. 냉동실에 넣어두었던 그릇을 꺼내 면을 담고 면 위에 준비한 재료들을 올린 후 얼음을 담습니다.", "8. 쯔유를 희석한 물을 담고는 김가루와 쪽파를 뿌려내면 완성입니다." };
	public static String[] yakiUdon = { "1. 우동볶음에 넣을 양파, 베이컨, 파를 준비해 줍니다.", "2. 식용유를 두르고 다진마늘2를 넣고 볶아 줍니다.",
			"3. 마늘을 볶다 양파, 베이컨을 함께 넣고 볶아줍니다.", "4. 맛술 3, 굴소스 2, 간장 2, 올리고당 2를 넣어줍니다.",
			"5. 재료를 준비하고(파, 양파, 베이컨) 볶으면서 옆에 불에서는 냄비에 물을 올리고 우동을 삶아 줍니다.",
			"6. 삶아 놓은 우동은 체에 올려 물기를 제거하고 양념해 놓은 냄비에 우동을 넣어 줍니다.", "7. 그리고 우동에 양념에 골고루 묻도록 볶아 줍니다.",
			"8. 씻어놓은 숙주를 올리고 대파 넣고 휘리릭 센불에서 볶아 줍니다.", "9. 마지막에 참기름, 후추를 넣어 마무리 해줍니다." };
	public static String[] hotPot = { "1. 시중에 파는 훠궈소스와 사골육수를 준비합니다.", "2. 훠궈소스를 준비해서 사골육수에 넣어줍니다.",
			"3. 한번 끓고 나면 건더기는 체에 건져놓습니다.", "4. 버섯과 어묵은 먹기좋게 잘라서 준비해줍니다.", "5. 배추와 청경채 그리고 나머지 야채를 간단히 손질해 준비해놓습니다.",
			"6. 샤브샤브용 소고기와 함께 끓여주시면 완성입니다." };
	public static String[] champon = { "1. 호박1/3개,양배추두줌,대파한줄기,양파1,땡초2개를 먹기좋게 썰어 줍니다.",
			"2. 그 다음 돼지고기 80g과 오징어 한 마리, 새우 4 마리를 준비해두고 돼지고기는 맛술 두 스푼 넣어서 잡내를 잡아줍니다.",
			"3. 식용유를 4 스푼 두르고 대파와 마늘 두 스푼을 중불에서 볶아 줍니다.", "4. 그 다음 돼지고기를 넣어서 볶아 줍니다.",
			"5. 고기 겉면이 익으면 고춧가루 6 스푼 넣어서 볶아 줍니다.", "6. 준비한 해물을 넣고 이때 부터는 계속 쌘불로 볶아 줍니다.",
			"7. 팬 가장자리에 간장 두 스푼을 뿌려 불맛을 내줍니다.", "8. 준비한 야채를 넣고 야채의 숨이 살짝 죽을때까지 볶아 줍니다.", "9. 물은 취향껏 내용물이 잠기게 부어 줍니다.",
			"10. 후추 4~5 번 톡톡, 액젓 한 스푼 넣습니다.", "11. 만들어 놓은 국물이 끓으면 면을 물에 한 번 데쳐 국물에 옮겨담아 마저 끓이면 완성입니다." };
	public static String[] mapoTofu = {
			"1. 간 돼지고기에 맛술 2 스푼과 후추 1/2스 푼을 넣어 재워두고 두부 2/3모는 2cm정도로 대파는 0.7cm두께로 각각 깍뚝으로나 송송썰어줍니다.",
			"2. 중불에 팬을 올리고 식용류나 고추기름을 붓고 파를 넣고 볶아줍니다.", "3. 파가 중간중간 갈색 나는게 보이면 중약불에서 마늘을 넣고 볶습니다.",
			"4. 마늘이 하얗게 익으면 맛술에 재워둔 고기를 넣고 중강불에서 갈색이 나도록 달달 볶습니다.", "5. 고기가 익으면 진간장 1 스푼을 팬 옆쪽으로 얇게 돌려서 끓여줍니다.",
			"6. 고기가 익으면 불을 약불로 줄이고 팬에 물을 붓고 두반장 1 스푼을 넣어줍니다.", "7. 고춧가루 1.5 스푼을 넣어줍니다.", "8. 굴소스 2 스푼을 넣어줍니다.",
			"9. 설탕을 1 스푼을 넣어줍니다.", "10. 맛술 2 스푼을 넣고 중불에서 고기에 양념이 베도록 1-2분정도 잘 섞어주면서 바글바글 끓여줍니다.",
			"11. 고기에 간이 베었으면 썰어놓은 두부를 넣고 양념이 잘 베이도록 섞어줍니다.", "12. 국물이 자작해질때까지 끓여주시면 끝입니다.",
			"13. 간단하지만 고기의 고소함에 살짝 달달하면서도 짭조름한 맛이 밥도둑이 따로 없는 맛입니다." };
	public static String[] menbosha = { "1. 새우 200g을 준비해줍니다.", "2. 새우를 다져줍니다.", "3. 식빵의 끝을 잘라준 뒤 4등분 해 준비해줍니다.",
			"4. 식빵에 올리브유를 한 쪽에만 발라주시고 올리브유 바른 쪽이 밑으로 향하게 해줍니다.",
			"5. 다진 새우와 소금 한 꼬집, 후추 한 꼬집, 계란 흰자, 전분 1 수저 넣고 섞어준 뒤 식빵 위에 올려줍니다.",
			"6. 식빵 위 쪽에도 올리브유를 발라주신 뒤 에어프라이어에서 약 145~150도로 10-15분 돌려줍니다.",
			"7. 노릇노릇 잘 익었는지 확인 후 꺼내주시고 그릇에 담아주시면 완성입니다." };
	public static String[] jiSamSeon = { "1. 기름솥에 온도가 160도 정도로 올라오면 편으로 썰어서 준비한 감자를 넣고 튀겨 줍니다.", "2. 노릇노릇하게 튀겨 건져냅니다.",
			"3. 가지를 어슷하게 썰어 마른 전분을 묻혀 튀겨 줍니다.", "4. 1 분정도 지나면 청홍피망 넣고 30초정도 지나면 건져 기름을 제거합니다.",
			"5. 펜에 식용유를 1 큰술 두르고 마늘편, 대파를 어슷하게 썰어 넣고 간장 1 큰술, 굴소스 1 티스푼, 정종 1 큰술 넣습니다.",
			"6. 향이 올라오면 육수를 한 국자 넣고 설탕 1 작은술, 치킨스톡 1 티스푼 넣고 후추 약간, 쌍노두소스 1 작은술 넣고 물 전분을 약간 넣어 끓여 줍니다.",
			"7. 마지막으로 준비해놨던 가지와 감자를 넣고 볶아주시면 완성입니다." };
	public static String[] gyoza = { "1. 고기와 야채를 최대한 잘게 다져 소금과 후추로 살짝 간만해서 속을 준비해줍니다.",
			"2. 양배추는 소금에 절였다가 물기를 최대한 짜서 보슬보슬한 상태로 만들어줍니다.", "3. 고기양념을 고기에 넣은후 점성이 생기게 섞어줍니다.",
			"4. 고기를 제외한 나머지 재료를 섞어줍니다.", "5. 준비해둔 재료 두 가지를 합쳐서 섞어줍니다.", "6. 만두피에 속을 채워 원하는 모양으로 만두를 잘 빚어줍니다.",
			"7. 잘빚어진 만두를 후라이팬에 노릇노릇 구우면 완성입니다." };
	public static String[] curry = { "1. 양파를 먹기좋게 썰어서 기름약간두르고 볶아주시고 맛소금은 아주 살짝 넣어줍니다.",
			"2. 감자와 당근넣고 기름 약간 넣고 볶고 맛소금 살짝넣고 볶아줍니다.", "3. 고기는 기름없이 볶은 후 맛소금, 후추 약간 뿌려서 볶아주시고 닭가슴살도 기름없이 볶아줍니다.",
			"4. 맛소금, 후추들과 함께 고기들이 어느정도 익으면 다 함께 섞어 또 한번 볶아주며 물 반 컵넣고 끓여줍니다.", "5. 카레 가루넣고 물 한컵 넣고 잘 풀어줍니다.",
			"6. 물이 팔팔 끓어오르면 카레물을 넣고 나머지 그릇에 묻어있는거 물로 헹궈서 넣어줍니다.", "7. 카레가 약간 걸쭉해지면 완성입니다." };
	public static String[] steak = { "1. 고기는 후추와 소금으로 밑간해 둡니다.",
			"2. 호박고지와 표고버섯은 미지근한 물에 충분히 불려서 물기를 제거해 주시고 풋마늘은 적당히 잘라주고, 남은 재료는 채썰어 준비해 줍니다.",
			"3. 굴소스랑 케찹, 돈까스 소스 등 섞어서 냄비에 한 번 끓여줍니다.", "4. 팬에 포도씨유 조금을 넣고 달군 뒤 마늘을 넣고 볶으면서 향을 내줍니다.",
			"5. 채소를 넣어 볶아줍니다.", "6. 한 번 끓인 소스에 볶은 채소를 넣고 볶아줍니다.",
			"7. 팬을 뜨겁게 달구어서 버터나 오일을 조금 두르고 고기를 구워주고 육즙이 올라오면 뒤집어서 구워주세요.",
			"8. 밥하고 고기를 접시에 담고 채소가 듬뿍 들어간 소스를 얹어 주시면 완성입니다." };
	public static String[] vongolePasta = {
			"1. 마늘은 편으로 썰어주시고 양파는 다져주시고 페퍼론치노는 반으로 잘라 주시고 바지락은 미리 해감해주시며 올리브 오일을 두른 팬에 마늘을 먼저 볶아줍니다.",
			"2. 다른팬에선 미리 면을 삶아주시고 마늘이 반쯤 익어간다면 다진 양파를 넣어줍니다.", "3. 양파가 투명해질때쯤 페퍼론치노를 넣어주시고 강한 불에서 바지락을 넣고 가볍게 볶아줍니다.",
			"4. 화이트 와인을 넣고 뚜껑을 닫지 않고 알콜성분이 날아가게 둡니다.", "5. 후추를 넣고 익힌면을 넣고 볶아줍니다.", "6. 면수를 살짝 넣어 농도와 간을 맞춰주시면 완성입니다." };
	public static String[] risotto = { "1. 쌀 3 컵을 준비합니다.",
			"2. 돼지 고기를 250g정도를 준비하고 생강가루, 후춧가루, 다진마늘, 설탕을 넣고 조물조물 버무려 줍니다.", "3. 마늘 3 개, 대파 1/3 개, 피망, 표고버섯을 준비합니다.",
			"4. 다진 마늘, 다진 파를 남비에 넣고 올리브유를 넉넉히 두르고 센불에 볶아줍니다.", "5. 돼지 고기 양념한 것을 넣어줍니다.",
			"6. 고기가 익으면 먹기 좋게 잘라주고 쌀을 넣고 센불에 볶아줍니다.", "7. 올리브유를 냄비 바닥에 두르고 쌀을 섞으면서 익혀줍니다.",
			"8. 물을 넣고 재빠르게 뒤적이면서 끓여주시고 올리브유를 두르고 볶기를 한번 더 하고 물도 한 번 더 넣으면서 쌀을 익혀줍니다.", "9. 다진 표고버섯과 피망을 넣어 줍니다.",
			"10. 우유와 모짜렐라 치즈를 넣고 섞어줍니다.", "11. 냄비 뚜껑을 덮고 치즈를 녹여 줍시면 완성입니다." };
	public static String[] wolnamSsam = { "1. 파프리카는 깨끗이 씻어 길쭉하게 적당한 채로 썰어주시고 게맛살도 같은 크기로 썰어놓습니다.",
			"2. 깻잎은 흐르는 물에 깨끗히 씻은 후 물기를 제거해줍니다.", "3. 미지근한 물에 라이스 페이퍼를 1 장 씩 5~10 초정도 담근 후 꺼냅니다.",
			"4. 도마나 넓은 접시에 깔고 준비한 모든 재료를 얹습니다.", "5. 재료를 감싸 돌돌 말아주면 월남쌈 완성입니다." };
	public static String[] riceNoodles = { "1. 양지 소고기를 삶아 육수 냅니다.", "2. 간장, 참치액, 소금으로 간 맞추면서 설탕 1T를 넣습니다.",
			"3. 쌀국수는 찬물에 30 분 이상 담궜다 먹으려할 때 뜨거운 물에 잠깐 들어갔다 나오면 됩니다.", "4. 숙주, 송송 썬 대파, 레몬, 그리고 고수를 준비합니다.",
			"5. 넉넉한 국수 그릇에 숙주를 좀 담은 후 살짝 데친 쌀국수를 담은 후 뜨거운 국물을 넉넉히 부어줍니다.",
			"6. 송송 썬 대파, 숙주 듬뿍, 편썬 고기, 고수 올려 스리라차 칠리소스나 해선장을 취향껏 넣어드시면 완성입니다." };
	public static String[] tteokbokki = { "1. 먼저 떡볶이떡을 물에 잠기도록 물 2 컵을 부어줍니다.", "2. 간장 2 스푼을 넣어줍니다.",
			"3. 고추장 1 스푼을 넣습니다.", "4. 고춧가루 1 스푼도 넣습니다.", "5. 그리고 설탕 2  스푼을 넣어줍니다.", "6. 바글바글 끓여주면 완성입니다." };
	public static String[] kimbab = { "1. 구성은 김은 물론, 맛살, 햄, 단무지, 우엉까지 집에 흔히있는 당근과 계란 그리고 시금치만 취향껏 준비해주시면 됩니다.",
			"2. 시금치를 간단한 양념에 무쳐놓습니다.", "3. 계란은 풀어 후라이팬에 동그랗게 올려주고 어느정도 익으면 반 접어줍니다.", "4. 햄은 선에 맞게 잘라준후 살짝 볶아줍니다.",
			"5. 계란은 먹기좋게 잘라주고 맛살은 반씩 찢어서 준비합니다.", "6. 당근은 채썰어서 휘리릭 볶아서 준비해줍니다.", "7. 단무지와 우엉은 그냥 봉지에서 뜯기만하면 준비는 끝납니다.",
			"8. 밥은 번거롭지만 참기름, 소금, 깨를 넣어 밑간을 해줍니다.", "9. 김에 밥을 얇게 깔고 준비한 내용물을 넣어주고 돌돌 말아 참기름 살짝 발라주면 완성입니다." };
	public static String[] omurice = { "1. 햄, 당근, 파, 양파를 다져 팬에 담습니다.", "2. 후추, 굴소스, 오일을 두르고 슥슥 볶아줍니다.",
			"3. 밥을 넣고 같이 볶습니다.", "4. 돈까스 소스, 케찹, 설탕, 물을 넣어 걸쭉하게 끓여 줍니다.", "5. 계란 풀어 팬에 붓고 저어 굽습니다.",
			"6. 그릇에 볶음밥을 담고 계란을 덮은 후 준비한 소스 올려 완성합니다." };
	public static String[] kimchiFriedRice = { "1. 김치를 먹기좋게 썰어 팬에 담아줍니다.",
			"2. 기름을 두르고 후추 약간과 김치 국물, 올리고당을 약간 넣어 볶아줍니다.", "3. 밥 1 인 분량을 넣고 굴소스는 취향대로 넣습니다.",
			"4. 밥알이 고슬고슬 해질 때까지 볶습니다.", "5. 계란프라이를 위에 얹으면 완성입니다." };
	public static String[] porkCutlet = { "1. 돼지고기 등심은 소금과 후춧가루를 뿌려 밑간해 줍니다.",
			"2. 양파와 마늘은 껍질을 벗겨 씻은 후 양파는 채 썰고 마늘은 편 썰어 줍니다.",
			"3. 달군 냄비에 식용유를 두르고 마늘과 양파를 넣고 볶다가 물과 돈까스 소스를 넣어 저으면서 보글보글 끓여 줍니다.",
			"4. 밑간한 돼지고기 등심은 밀가루를 묻힌 후 달걀옷을 묻혀 줍니다.", "5. 빵가루와 파슬리가루를 섞은 다음 돼지고기를 넣고 꾹꾹 눌러 가면서 고루 묻혀 줍니다.",
			"6. 달군 프라이팬에 식용유를 두르고 180도씨로 가열 한 다음 돼지고기를 넣고 앞뒤로 노릇노릇하게 튀겨 줍니다.",
			"7. 튀겨 낸 돼지고기는 키친타월을 깔고 기름기를 제거해 주시고 먹기 좋은 크기로 썰어 준 다음 밥과 돈까스를 그릇에 담고 돈가스 소스를 뿌려 내면 완성입니다." };
	public static String[] feastNoodles = {
			"1. 냄비에 물 3000ml넣고 찬물에서부터 양파1 개, 무 1/4 쪽, 대파 1 뿌리, 다시마, 멸치를 넣고 30분간 센불에서 푹 끓입니다.",
			"2. 육수가 끓는동안 양파, 당근, 애호박은 얇게 채썰어 준비합니다.",
			"3. 육수 야채가 숨이 죽으면 다 건져내고 채썬 야채를 넣어 간장 2 큰술, 소금 2 큰술, 후추 1 작은술과 센불에서 10분간 끓입니다.", "4. 야채가 익으면 달걀을 풀어 넣습니다.",
			"5. 국수를 삶아 찬물에 행구고 물기 제거 후 그릇에 담고 육수를 부어 김가루로 마무리하면 완성입니다." };
}